CSI API ETABS v1

# cPointElmGetSpringCoupled Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int GetSpringCoupled(
    	string Name,
    	ref double[] K
    )

    Function GetSpringCoupled (
    	Name As String,
    	ByRef K As Double()
    ) As Integer

    Dim instance As cPointElm
    Dim Name As String
    Dim K As Double()
    Dim returnValue As Integer

    returnValue = instance.GetSpringCoupled(Name,
    	K)

    int GetSpringCoupled(
    	String^ Name,
    	array<double>^% K
    )

    abstract GetSpringCoupled :
            Name : string *
            K : float[] byref -> int

#### Parameters

Name

    Type: SystemString

K

    Type: SystemDouble

#### Return Value

Type: Int32

See Also

#### Reference

cPointElm Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com